index.html
<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"/><meta name="viewport" content="width=device-width, initial-scale=1.0"/><meta name="author" content="Reinhard Stahn"/><title>Solutions for the bible of Quantum Computation and Quantum Information</title><!-- https://simplecss.org - License: MIT - We are using ./simple.css from commit dcb3545f2304356985c99acce9471ba3f559976b from https://github.com/kevquirk/simple.css --><link rel="stylesheet" href="./css/simple.css"/><link rel="stylesheet" href="./css/style.css"/></head><body><nav><a href="index.html">HOME</a></nav><h1 class="title">Solutions for the bible of Quantum Computation and Quantum Information</h1><p>
This website contains solutions for <i>some</i> of the exercises from `Quantum Computation and Quantum
Information` (Nielsen, Michael A. and Chuang, Isaac L., 2011) (aka "Mike and Ike"). I am not an
expert in quantum mechanics but I am an experienced mathematician and a software developer who
enjoys solving these exercises. There are already tons of solutions out there but some solutions are
hard to find and so I think there is a certain value in sharing my solutions.
</p>

<p>
The site is generated from <a href="https://orgmode.org/index.html">org-mode</a> files hosted on <a href="https://github.com/rainij/solutions-qcqi-nielsen-chuang">github</a>. The code within the org files is mostly
python. To interact with it you can <i>tangle</i> the org file into a python file which then can be
loaded into <code>ipython</code>. But you probably need <a href="https://www.gnu.org/software/emacs/">Emacs</a> to do so, because only Emacs has support for the
more sophisticated features of the almighty org-mode. See the <a href="https://github.com/rainij/solutions-qcqi-nielsen-chuang">README</a> of the repository for more
information.
</p>

<ul class="org-ul">
<li><a href="notation.html">Notation</a></li>
<li><a href="utils.html">Utilities</a></li>
<li>Part I
<ul class="org-ul">
<li><a href="chapter_2.html">Chapter 2</a></li>
<li><a href="chapter_3.html">Chapter 3</a></li>
</ul></li>
<li>Part II
<ul class="org-ul">
<li><a href="chapter_4.html">Chapter 4</a></li>
<li><a href="chapter_5.html">Chapter 5</a></li>
</ul></li>
</ul>
<footer class="footer"><p>Made by <a href="https://github.com/rainij">Reinhard Stahn</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.60 (<a href="https://orgmode.org">Org</a> mode 9.6.1)</p><p>Find the source code on <a href="https://github.com/rainij/solutions-qcqi-nielsen-chuang">Github</a></p></footer></body></html>